
# 대분류 처리 kw: 레시피, value: 유저 데이터
VAGUE_INGRED_CATEGORIES = {
    "돼지고기": {'돼지고기', '돼지고기갈비', '돼지고기다짐육', '돼지고기대패목살', '돼지고기대패삼겹살', '돼지고기뒷다리살',
             '돼지고기등갈비', '돼지고기등뼈', '돼지고기등심', '돼지고기목살', '돼지고기목심', '돼지고기불고기', '돼지고기사태살',
             '돼지고기삼겹살', '돼지고기안심살', '돼지고기앞다리살', '돼지고기오겹살', '돼지고기오돌뼈', '돼지고기지방', '돼지고기항정살'},
    "소고기" : {'소고기', '소고기갈비', '소고기국거리', '소고기다짐육', '소고기등심', '소고기목심', '소고기부채살', '소고기불고기',
             '소고기사태살', '소고기살치살', '소고기샤브샤브', '소고기안심', '소고기앞다리살', '소고기양지', '소고기우둔살',
             '소고기우삼겹살', '소고기차돌박이', '소고기채끝살', '소고기척아이롤', '소고기치마살', '소고기홍두께살'},
    "닭고기": {'닭고기', '닭가슴살통조림', '닭고기가슴살', '닭고기날개', '닭고기다리살', '닭고기똥집', '닭고기목살', '닭고기발',
            '닭고기봉', '닭고기안심살'},
    "액젓" : {'액젓', '멸치액젓', '참치액젓'}, # 까나리 등 제외
    "상추" : {'상추', '청상추', '적상추', '꽃상추'}, # 로메인 제외
    "조개" : {'조개', '키조개', '모시조개'},
    "과일잼" : {'과일잼', '살구잼', '사과잼', '블루베리잼', '라즈베리잼', '체리잼', '오디잼', '망고잼', '포도잼', '딸기잼'},
    "쌀밥" : {'쌀'},
    "버섯" : {'버섯', '양송이버섯', '느타리버섯', '새송이버섯', '팽이버섯', '백만송이버섯', '표고버섯', '맛타리버섯', '머쉬마루버섯',
           '삼색버섯', '만가닥버섯', '목이버섯', '참타리버섯', '고기느타리버섯'}, # 건버섯 제외
    "견과류": {'견과류', '견과류콩배기', '견과류호박씨', '견과류아몬드', '견과류해바라기씨', '견과류헤이즐넛', '견과류아몬드가루',
            '견과류잣', '견과류피칸', '견과류브라질너트', '견과류땅콩분태', '견과류땅콩', '견과류아몬드분태', '견과류캐슈넛',
            '견과류호두', '견과류호두분태'}
}
